data_collection_manual/jmeter_tests/loc_ret_jmeter_tests/loc_ret_lmb50.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="locsim test plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="filename">/Users/dtfernando/Documents/cloudslab/iAnomaly_toolkit/applications/location_retrieval_app/jmeter_tests/vehicle_ids.csv</stringProp>
        <boolProp name="ignoreFirstLine">false</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="variableNames">vehicleID</stringProp>
      </CSVDataSet>
      <hashTree/>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="jp@gc - Ultimate Thread Group">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="-740925457">
            <stringProp name="1663">43</stringProp>
            <stringProp name="0">0</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1151160535">
            <stringProp name="1666">46</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1959913595">
            <stringProp name="1638">39</stringProp>
            <stringProp name="50">2</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1176572258">
            <stringProp name="1666">46</stringProp>
            <stringProp name="51">3</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-87190579">
            <stringProp name="1691">50</stringProp>
            <stringProp name="52">4</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1178836374">
            <stringProp name="1666">46</stringProp>
            <stringProp name="53">5</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1250156028">
            <stringProp name="1668">48</stringProp>
            <stringProp name="54">6</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-48700607">
            <stringProp name="1692">51</stringProp>
            <stringProp name="55">7</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="971669760">
            <stringProp name="1660">40</stringProp>
            <stringProp name="56">8</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="199220095">
            <stringProp name="1699">58</stringProp>
            <stringProp name="57">9</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="36241007">
            <stringProp name="1667">47</stringProp>
            <stringProp name="1567">10</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1192428032">
            <stringProp name="1693">52</stringProp>
            <stringProp name="1568">11</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-207151463">
            <stringProp name="1660">40</stringProp>
            <stringProp name="1569">12</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-42496606">
            <stringProp name="1664">44</stringProp>
            <stringProp name="1570">13</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1118248953">
            <stringProp name="1636">37</stringProp>
            <stringProp name="1571">14</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1199845991">
            <stringProp name="1692">51</stringProp>
            <stringProp name="1572">15</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1058338741">
            <stringProp name="1696">55</stringProp>
            <stringProp name="1573">16</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="67313020">
            <stringProp name="1667">47</stringProp>
            <stringProp name="1574">17</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-985887029">
            <stringProp name="1698">57</stringProp>
            <stringProp name="1575">18</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-35704258">
            <stringProp name="1664">44</stringProp>
            <stringProp name="1576">19</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="210965222">
            <stringProp name="1669">49</stringProp>
            <stringProp name="1598">20</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-947516221">
            <stringProp name="1697">56</stringProp>
            <stringProp name="1599">21</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-630354191">
            <stringProp name="1724">62</stringProp>
            <stringProp name="1600">22</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="2009416927">
            <stringProp name="1638">39</stringProp>
            <stringProp name="1601">23</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="745654090">
            <stringProp name="1663">43</stringProp>
            <stringProp name="1602">24</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="852067542">
            <stringProp name="1666">46</stringProp>
            <stringProp name="1603">25</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1907531707">
            <stringProp name="1635">36</stringProp>
            <stringProp name="1604">26</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="959613052">
            <stringProp name="1669">49</stringProp>
            <stringProp name="1605">27</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-339243583">
            <stringProp name="1693">52</stringProp>
            <stringProp name="1606">28</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="856595774">
            <stringProp name="1666">46</stringProp>
            <stringProp name="1607">29</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="787421072">
            <stringProp name="1662">42</stringProp>
            <stringProp name="1629">30</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-242631370">
            <stringProp name="1693">52</stringProp>
            <stringProp name="1630">31</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-311686908">
            <stringProp name="1691">50</stringProp>
            <stringProp name="1631">32</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-99992062">
            <stringProp name="1697">56</stringProp>
            <stringProp name="1632">33</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="955472103">
            <stringProp name="1666">46</stringProp>
            <stringProp name="1633">34</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="991697959">
            <stringProp name="1667">47</stringProp>
            <stringProp name="1634">35</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="852454825">
            <stringProp name="1663">43</stringProp>
            <stringProp name="1635">36</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-485063484">
            <stringProp name="1725">63</stringProp>
            <stringProp name="1636">37</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="889812739">
            <stringProp name="1664">44</stringProp>
            <stringProp name="1637">38</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-23012118">
            <stringProp name="1699">58</stringProp>
            <stringProp name="1638">39</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <stringProp name="HTTPSampler.domain">100.88.28.171</stringProp>
          <stringProp name="HTTPSampler.port">9090</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/get_location/${vehicleID}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <TestAction guiclass="TestActionGui" testclass="TestAction" testname="Think Time" enabled="true">
          <intProp name="ActionProcessor.action">1</intProp>
          <intProp name="ActionProcessor.target">0</intProp>
          <stringProp name="ActionProcessor.duration">0</stringProp>
        </TestAction>
        <hashTree>
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Pause" enabled="true">
            <stringProp name="ConstantTimer.delay">997</stringProp>
            <stringProp name="RandomTimer.range">20</stringProp>
          </UniformRandomTimer>
          <hashTree/>
        </hashTree>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <intProp name="LoopController.loops">-1</intProp>
        </LoopController>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>